{"item":[{"article_id":"14","article_date":"0000-00-00 00:00:00","article_headline":"Pats win the league","article_image":"news_1.png","article_caption":"Killian Brennan celebrates","article_text":"St Pats wrapped up...."},{"article_id":"16","article_date":"0000-00-00 00:00:00","article_headline":"Pfai announce new app","article_image":"news_2.png","article_caption":"Stephen McGuiness","article_text":"This course introduces the Java programming language and how to develop Java applications using Eclipse. Students learn the syntax of the Java programming language, object-oriented programming using Java, exception handling, generics, collections, and file input\/output (I\/O). During the course, students will develop and test Java applications using Eclipse. Throughout the course students will also work on a \"project\" which develops a complex Java application by applying principles learned to meet changing application requirements. This project is intended to simulate the programming environment they would encounter in real-world projects by providing application requirements and challenging the student to write Java code to meet those requirements. Extensive practical exercises take students through all major aspects of the design and development of Java programs. Students will be introduced to various wizards and tools available from Eclipse. After completing this course, the stu"},{"article_id":"18","article_date":"0000-00-00 00:00:00","article_headline":"Gary O'Neill undergoes treatment for testicular cancer","article_image":"news_3.png","article_caption":"Gary O'Neill in action for Drogheda United.","article_text":"Gary O'Neill will stop playing football ....."},{"article_id":"19","article_date":"0000-00-00 00:00:00","article_headline":"New Headling","article_image":"news.png","article_caption":"New Caption","article_text":"New Story"},{"article_id":"21","article_date":"0000-00-00 00:00:00","article_headline":"Rafter Signs for Cork.","article_image":"rafter.png","article_caption":"Micheal Rafter in action.","article_text":"Cork City today confirmed the signing of Micheal Rafter from Derry."},{"article_id":"23","article_date":"Wed, 11 Dec 2013 13:04:49","article_headline":"time test","article_image":"news.png","article_caption":"test","article_text":"test"}]}